{
  "backend/main.mo": "Motoko actor defining health monitoring data types (HealthMetric, MovementAnomaly, AlarmEvent) and providing public functions to add/retrieve health metrics, movement anomalies, and alarm events with time-range filtering.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: Internet Identity login page, Bluetooth connection UI controls, and Web Bluetooth API integration with associated files and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend TypeScript/React components covering authentication, Bluetooth integration, health dashboards, charts, alarms, and utility functions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Vital Monitor application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, displaying LoginPage for unauthenticated users or the main health dashboard with alarms, metrics, anomalies, and trends for authenticated users.",
  "frontend/src/components/AlarmCard.tsx": "Component rendering a single critical alarm alert with message, timestamp, and dismiss button using destructive styling.",
  "frontend/src/components/AlarmHistoryView.tsx": "Full-page view displaying all alarm events sorted by timestamp with back navigation and empty state handling.",
  "frontend/src/components/AlarmNotificationSystem.tsx": "Section displaying active alarms with count badge and toggle to view alarm history, hiding when no active alarms exist.",
  "frontend/src/components/AnomalyListItem.tsx": "List item component for movement anomalies with description, timestamp, and visual highlighting for recent events.",
  "frontend/src/components/BloodPressureCard.tsx": "Card displaying blood pressure readings (systolic/diastolic) with color-coded status badge based on standard BP ranges and formatted timestamp.",
  "frontend/src/components/BloodPressureChart.tsx": "Renders a line chart displaying systolic and diastolic blood pressure trends over time using Recharts, with reference lines at 120/80 and formatted timestamps.",
  "frontend/src/components/BluetoothConnectionButton.tsx": "Provides a button with popover UI for connecting/disconnecting Bluetooth health monitoring devices, displaying connection status, device info, and error messages.",
  "frontend/src/components/DateRangeSelector.tsx": "A dropdown select component for choosing time ranges (24h, 7d, 30d) to filter health metric data.",
  "frontend/src/components/HealthDashboard.tsx": "Main dashboard component that displays current vital signs (heart rate, blood pressure, hypertension risk) from the latest health metric, with loading and error states.",
  "frontend/src/components/HealthTrendsView.tsx": "Displays historical health trends with date range filtering, showing heart rate and blood pressure charts side-by-side in a grid layout.",
  "frontend/src/components/HeartRateCard.tsx": "Card component displaying current heart rate in BPM with status badge (Low/Normal/Elevated/High) and last update timestamp.",
  "frontend/src/components/HeartRateChart.tsx": "Renders a line chart showing heart rate trends over time with reference lines at 60 and 100 BPM using Recharts.",
  "frontend/src/components/HypertensionRiskIndicator.tsx": "Card component that displays an alert indicating whether hypertension risk is detected based on blood pressure readings.",
  "frontend/src/components/LoginPage.tsx": "Landing page with Internet Identity authentication, displaying app features and a login button with status feedback.",
  "frontend/src/components/MovementAnomalySection.tsx": "Displays a section showing movement anomalies with loading states, error handling, and filtering for recent anomalies within the last hour. Renders anomalies in a card with an icon and uses AnomalyListItem components for each entry.",
  "frontend/src/components/PageLayout.tsx": "Provides the main application layout with a sticky header containing the app title and Bluetooth/sign-out buttons, a main content area, and a footer with copyright and caffeine.ai attribution.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAlarmEvents.ts": "Manages alarm events with localStorage-based dismissal tracking, filtering out dismissed alarms from the active list and providing a dismissAlarm function.",
  "frontend/src/hooks/useBluetooth.ts": "Provides Web Bluetooth API integration for connecting to Bluetooth devices with support for heart rate, battery, and device information services, including connection state management and error handling.",
  "frontend/src/hooks/useHealthMetrics.ts": "Simple wrapper hook that calls useHealthMetricsQuery with a provided or default date range of 24 hours.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, identity persistence, and delegation validation using DFINITY's AuthClient.",
  "frontend/src/hooks/useMovementAnomalies.ts": "Simple wrapper hook that calls useMovementAnomaliesQuery with a default date range of 7 days.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching health metrics, movement anomalies, and alarm events from the backend actor with configurable date ranges and automatic polling intervals.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with a medical-themed color palette using soft greens, health status colors (normal/warning/critical), and custom design tokens for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/types/bluetooth.d.ts": "TypeScript type declarations for the Web Bluetooth API, defining interfaces for Bluetooth devices, GATT servers, services, characteristics, and navigator integration.",
  "frontend/src/utils/timeUtils.ts": "Utility functions for converting between JavaScript milliseconds and IC nanosecond timestamps, formatting timestamps for display and charts, and calculating date ranges for queries.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, health-specific colors, extended theme settings, and animation keyframes for UI components.",
  "project_state.json": "Project metadata tracking the health monitoring app's features including authentication, Bluetooth connectivity, 2-minute interval recording, and CSV export functionality with pending feature requests."
}